"""

Домашнее задание №1

Условный оператор: Возраст

* Попросить пользователя ввести возраст при помощи input и положить
  результат в переменную
* Написать функцию, которая по возрасту определит, чем должен заниматься пользователь:
  учиться в детском саду, школе, ВУЗе или работать
* Вызвать функцию, передав ей возраст пользователя и положить результат
  работы функции в переменную
* Вывести содержимое переменной на экран

"""

def main():
    age = int(input('Введите свой возраст: '))
    if age < 7:
      print('Детский сад')
    elif 6 < age < 19:
      print('Школа')
    elif 18 < age < 25:
      print('Вуз')
    else:
      print('Работа')

if __name__ == "__main__":
    main()
